# Theme
skyliss.lotus-theme
PKief.material-icon-theme

# Editor
vscodevim.vim
dzhavat.bracket-pair-toggler

# Version Control / Git
donjayamanne.githistory
eamodio.gitlens
github.vscode-pull-request-github

# Linting / Formatting
biomejs.biome
DavidAnson.vscode-markdownlint
esbenp.prettier-vscode

# Language support
golang.go
oven.bun-vscode
rust-lang.rust-analyzer

# Library support
bradlc.vscode-tailwindcss

# YAML / Config
redhat.vscode-yaml
tamasfe.even-better-toml

# Containers / Remote
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers
ms-azuretools.vscode-containers

# Markdown
yzhang.markdown-all-in-one
DavidAnson.vscode-markdownlint
shd101wyy.markdown-preview-enhanced

MermaidChart.vscode-mermaid-chart

# Utils
christian-kohler.path-intellisense